MikroElektronika/core_packages/PIC/XC8/def/PIC16F1503/mcu.h
extern volatile CLC2CONbits_t CLC2CONbits __at(0xF18);
// bitfield macros
#define _CLC2CON_LC2MODE0_POSN                              0x0
#define _CLC2CON_LC2MODE0_POSITION                          0x0
#define _CLC2CON_LC2MODE0_SIZE                              0x1
#define _CLC2CON_LC2MODE0_LENGTH                            0x1
#define _CLC2CON_LC2MODE0_MASK                              0x1
#define _CLC2CON_LC2MODE1_POSN                              0x1
#define _CLC2CON_LC2MODE1_POSITION                          0x1
#define _CLC2CON_LC2MODE1_SIZE                              0x1
#define _CLC2CON_LC2MODE1_LENGTH                            0x1
#define _CLC2CON_LC2MODE1_MASK                              0x2
#define _CLC2CON_LC2MODE2_POSN                              0x2
#define _CLC2CON_LC2MODE2_POSITION                          0x2
#define _CLC2CON_LC2MODE2_SIZE                              0x1
#define _CLC2CON_LC2MODE2_LENGTH                            0x1
#define _CLC2CON_LC2MODE2_MASK                              0x4
#define _CLC2CON_LC2INTN_POSN                               0x3
#define _CLC2CON_LC2INTN_POSITION                           0x3
#define _CLC2CON_LC2INTN_SIZE                               0x1
#define _CLC2CON_LC2INTN_LENGTH                             0x1
#define _CLC2CON_LC2INTN_MASK                               0x8
#define _CLC2CON_LC2INTP_POSN                               0x4
#define _CLC2CON_LC2INTP_POSITION                           0x4
#define _CLC2CON_LC2INTP_SIZE                               0x1
#define _CLC2CON_LC2INTP_LENGTH                             0x1
#define _CLC2CON_LC2INTP_MASK                               0x10
#define _CLC2CON_LC2OUT_POSN                                0x5
#define _CLC2CON_LC2OUT_POSITION                            0x5
#define _CLC2CON_LC2OUT_SIZE                                0x1
#define _CLC2CON_LC2OUT_LENGTH                              0x1
#define _CLC2CON_LC2OUT_MASK                                0x20
#define _CLC2CON_LC2OE_POSN                                 0x6
#define _CLC2CON_LC2OE_POSITION                             0x6
#define _CLC2CON_LC2OE_SIZE                                 0x1
#define _CLC2CON_LC2OE_LENGTH                               0x1
#define _CLC2CON_LC2OE_MASK                                 0x40
#define _CLC2CON_LC2EN_POSN                                 0x7
#define _CLC2CON_LC2EN_POSITION                             0x7
#define _CLC2CON_LC2EN_SIZE                                 0x1
#define _CLC2CON_LC2EN_LENGTH                               0x1
#define _CLC2CON_LC2EN_MASK                                 0x80
#define _CLC2CON_LCMODE0_POSN                               0x0
#define _CLC2CON_LCMODE0_POSITION                           0x0
#define _CLC2CON_LCMODE0_SIZE                               0x1
#define _CLC2CON_LCMODE0_LENGTH                             0x1
#define _CLC2CON_LCMODE0_MASK                               0x1
#define _CLC2CON_LCMODE1_POSN                               0x1
#define _CLC2CON_LCMODE1_POSITION                           0x1
#define _CLC2CON_LCMODE1_SIZE                               0x1
#define _CLC2CON_LCMODE1_LENGTH                             0x1
#define _CLC2CON_LCMODE1_MASK                               0x2
#define _CLC2CON_LCMODE2_POSN                               0x2
#define _CLC2CON_LCMODE2_POSITION                           0x2
#define _CLC2CON_LCMODE2_SIZE                               0x1
#define _CLC2CON_LCMODE2_LENGTH                             0x1
#define _CLC2CON_LCMODE2_MASK                               0x4
#define _CLC2CON_LCINTN_POSN                                0x3
#define _CLC2CON_LCINTN_POSITION                            0x3
#define _CLC2CON_LCINTN_SIZE                                0x1
#define _CLC2CON_LCINTN_LENGTH                              0x1
#define _CLC2CON_LCINTN_MASK                                0x8
#define _CLC2CON_LCINTP_POSN                                0x4
#define _CLC2CON_LCINTP_POSITION                            0x4
#define _CLC2CON_LCINTP_SIZE                                0x1
#define _CLC2CON_LCINTP_LENGTH                              0x1
#define _CLC2CON_LCINTP_MASK                                0x10
#define _CLC2CON_LCOUT_POSN                                 0x5
#define _CLC2CON_LCOUT_POSITION                             0x5
#define _CLC2CON_LCOUT_SIZE                                 0x1
#define _CLC2CON_LCOUT_LENGTH                               0x1
#define _CLC2CON_LCOUT_MASK                                 0x20
#define _CLC2CON_LCOE_POSN                                  0x6
#define _CLC2CON_LCOE_POSITION                              0x6
#define _CLC2CON_LCOE_SIZE                                  0x1
#define _CLC2CON_LCOE_LENGTH                                0x1
#define _CLC2CON_LCOE_MASK                                  0x40
#define _CLC2CON_LCEN_POSN                                  0x7
#define _CLC2CON_LCEN_POSITION                              0x7
#define _CLC2CON_LCEN_SIZE                                  0x1
#define _CLC2CON_LCEN_LENGTH                                0x1
#define _CLC2CON_LCEN_MASK                                  0x80
#define _CLC2CON_LC2MODE_POSN                               0x0
#define _CLC2CON_LC2MODE_POSITION                           0x0
#define _CLC2CON_LC2MODE_SIZE                               0x3
#define _CLC2CON_LC2MODE_LENGTH                             0x3
#define _CLC2CON_LC2MODE_MASK                               0x7

// Register: CLC2POL
#define CLC2POL CLC2POL
extern volatile unsigned char           CLC2POL             __at(0xF19);
#ifndef _LIB_BUILD
asm("CLC2POL equ 0F19h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LC2G1POL               :1;
        unsigned LC2G2POL               :1;
        unsigned LC2G3POL               :1;
        unsigned LC2G4POL               :1;
        unsigned                        :3;
        unsigned LC2POL                 :1;
    };
    struct {
        unsigned G1POL                  :1;
        unsigned G2POL                  :1;
        unsigned G3POL                  :1;
        unsigned G4POL                  :1;
        unsigned                        :3;
        unsigned POL                    :1;
    };
} CLC2POLbits_t;
extern volatile CLC2POLbits_t CLC2POLbits __at(0xF19);
// bitfield macros
#define _CLC2POL_LC2G1POL_POSN                              0x0
#define _CLC2POL_LC2G1POL_POSITION                          0x0
#define _CLC2POL_LC2G1POL_SIZE                              0x1
#define _CLC2POL_LC2G1POL_LENGTH                            0x1
#define _CLC2POL_LC2G1POL_MASK                              0x1
#define _CLC2POL_LC2G2POL_POSN                              0x1
#define _CLC2POL_LC2G2POL_POSITION                          0x1
#define _CLC2POL_LC2G2POL_SIZE                              0x1
#define _CLC2POL_LC2G2POL_LENGTH                            0x1
#define _CLC2POL_LC2G2POL_MASK                              0x2
#define _CLC2POL_LC2G3POL_POSN                              0x2
#define _CLC2POL_LC2G3POL_POSITION                          0x2
#define _CLC2POL_LC2G3POL_SIZE                              0x1
#define _CLC2POL_LC2G3POL_LENGTH                            0x1
#define _CLC2POL_LC2G3POL_MASK                              0x4
#define _CLC2POL_LC2G4POL_POSN                              0x3
#define _CLC2POL_LC2G4POL_POSITION                          0x3
#define _CLC2POL_LC2G4POL_SIZE                              0x1
#define _CLC2POL_LC2G4POL_LENGTH                            0x1
#define _CLC2POL_LC2G4POL_MASK                              0x8
#define _CLC2POL_LC2POL_POSN                                0x7
#define _CLC2POL_LC2POL_POSITION                            0x7
#define _CLC2POL_LC2POL_SIZE                                0x1
#define _CLC2POL_LC2POL_LENGTH                              0x1
#define _CLC2POL_LC2POL_MASK                                0x80
#define _CLC2POL_G1POL_POSN                                 0x0
#define _CLC2POL_G1POL_POSITION                             0x0
#define _CLC2POL_G1POL_SIZE                                 0x1
#define _CLC2POL_G1POL_LENGTH                               0x1
#define _CLC2POL_G1POL_MASK                                 0x1
#define _CLC2POL_G2POL_POSN                                 0x1
#define _CLC2POL_G2POL_POSITION                             0x1
#define _CLC2POL_G2POL_SIZE                                 0x1
#define _CLC2POL_G2POL_LENGTH                               0x1
#define _CLC2POL_G2POL_MASK                                 0x2
#define _CLC2POL_G3POL_POSN                                 0x2
#define _CLC2POL_G3POL_POSITION                             0x2
#define _CLC2POL_G3POL_SIZE                                 0x1
#define _CLC2POL_G3POL_LENGTH                               0x1
#define _CLC2POL_G3POL_MASK                                 0x4
#define _CLC2POL_G4POL_POSN                                 0x3
#define _CLC2POL_G4POL_POSITION                             0x3
#define _CLC2POL_G4POL_SIZE                                 0x1
#define _CLC2POL_G4POL_LENGTH                               0x1
#define _CLC2POL_G4POL_MASK                                 0x8
#define _CLC2POL_POL_POSN                                   0x7
#define _CLC2POL_POL_POSITION                               0x7
#define _CLC2POL_POL_SIZE                                   0x1
#define _CLC2POL_POL_LENGTH                                 0x1
#define _CLC2POL_POL_MASK                                   0x80

// Register: CLC2SEL0
#define CLC2SEL0 CLC2SEL0
extern volatile unsigned char           CLC2SEL0            __at(0xF1A);
#ifndef _LIB_BUILD
asm("CLC2SEL0 equ 0F1Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LC2D1S0                :1;
        unsigned LC2D1S1                :1;
        unsigned LC2D1S2                :1;
        unsigned                        :1;
        unsigned LC2D2S0                :1;
        unsigned LC2D2S1                :1;
        unsigned LC2D2S2                :1;
    };
    struct {
        unsigned D1S0                   :1;
        unsigned D1S1                   :1;
        unsigned D1S2                   :1;
        unsigned                        :1;
        unsigned D2S0                   :1;
        unsigned D2S1                   :1;
        unsigned D2S2                   :1;
    };
    struct {
        unsigned LC2D1S                 :3;
        unsigned                        :1;
        unsigned LC2D2S                 :3;
    };
} CLC2SEL0bits_t;
extern volatile CLC2SEL0bits_t CLC2SEL0bits __at(0xF1A);
// bitfield macros
#define _CLC2SEL0_LC2D1S0_POSN                              0x0
#define _CLC2SEL0_LC2D1S0_POSITION                          0x0
#define _CLC2SEL0_LC2D1S0_SIZE                              0x1
#define _CLC2SEL0_LC2D1S0_LENGTH                            0x1
#define _CLC2SEL0_LC2D1S0_MASK                              0x1
#define _CLC2SEL0_LC2D1S1_POSN                              0x1
#define _CLC2SEL0_LC2D1S1_POSITION                          0x1
#define _CLC2SEL0_LC2D1S1_SIZE                              0x1
#define _CLC2SEL0_LC2D1S1_LENGTH                            0x1
#define _CLC2SEL0_LC2D1S1_MASK                              0x2
#define _CLC2SEL0_LC2D1S2_POSN                              0x2
#define _CLC2SEL0_LC2D1S2_POSITION                          0x2
#define _CLC2SEL0_LC2D1S2_SIZE                              0x1
#define _CLC2SEL0_LC2D1S2_LENGTH                            0x1
#define _CLC2SEL0_LC2D1S2_MASK                              0x4
#define _CLC2SEL0_LC2D2S0_POSN                              0x4
#define _CLC2SEL0_LC2D2S0_POSITION                          0x4
#define _CLC2SEL0_LC2D2S0_SIZE                              0x1
#define _CLC2SEL0_LC2D2S0_LENGTH                            0x1
#define _CLC2SEL0_LC2D2S0_MASK                              0x10
#define _CLC2SEL0_LC2D2S1_POSN                              0x5
#define _CLC2SEL0_LC2D2S1_POSITION                          0x5
#define _CLC2SEL0_LC2D2S1_SIZE                              0x1
#define _CLC2SEL0_LC2D2S1_LENGTH                            0x1
#define _CLC2SEL0_LC2D2S1_MASK                              0x20
#define _CLC2SEL0_LC2D2S2_POSN                              0x6
#define _CLC2SEL0_LC2D2S2_POSITION                          0x6
#define _CLC2SEL0_LC2D2S2_SIZE                              0x1
#define _CLC2SEL0_LC2D2S2_LENGTH                            0x1
#define _CLC2SEL0_LC2D2S2_MASK                              0x40
#define _CLC2SEL0_D1S0_POSN                                 0x0
#define _CLC2SEL0_D1S0_POSITION                             0x0
#define _CLC2SEL0_D1S0_SIZE                                 0x1
#define _CLC2SEL0_D1S0_LENGTH                               0x1
#define _CLC2SEL0_D1S0_MASK                                 0x1
#define _CLC2SEL0_D1S1_POSN                                 0x1
#define _CLC2SEL0_D1S1_POSITION                             0x1
#define _CLC2SEL0_D1S1_SIZE                                 0x1
#define _CLC2SEL0_D1S1_LENGTH                               0x1
#define _CLC2SEL0_D1S1_MASK                                 0x2
#define _CLC2SEL0_D1S2_POSN                                 0x2
#define _CLC2SEL0_D1S2_POSITION                             0x2
#define _CLC2SEL0_D1S2_SIZE                                 0x1
#define _CLC2SEL0_D1S2_LENGTH                               0x1
#define _CLC2SEL0_D1S2_MASK                                 0x4
#define _CLC2SEL0_D2S0_POSN                                 0x4
#define _CLC2SEL0_D2S0_POSITION                             0x4
#define _CLC2SEL0_D2S0_SIZE                                 0x1
#define _CLC2SEL0_D2S0_LENGTH                               0x1
#define _CLC2SEL0_D2S0_MASK                                 0x10
#define _CLC2SEL0_D2S1_POSN                                 0x5
#define _CLC2SEL0_D2S1_POSITION                             0x5
#define _CLC2SEL0_D2S1_SIZE                                 0x1
#define _CLC2SEL0_D2S1_LENGTH                               0x1
#define _CLC2SEL0_D2S1_MASK                                 0x20
#define _CLC2SEL0_D2S2_POSN                                 0x6
#define _CLC2SEL0_D2S2_POSITION                             0x6
#define _CLC2SEL0_D2S2_SIZE                                 0x1
#define _CLC2SEL0_D2S2_LENGTH                               0x1
#define _CLC2SEL0_D2S2_MASK                                 0x40
#define _CLC2SEL0_LC2D1S_POSN                               0x0
#define _CLC2SEL0_LC2D1S_POSITION                           0x0
#define _CLC2SEL0_LC2D1S_SIZE                               0x3
#define _CLC2SEL0_LC2D1S_LENGTH                             0x3
#define _CLC2SEL0_LC2D1S_MASK                               0x7
#define _CLC2SEL0_LC2D2S_POSN                               0x4
#define _CLC2SEL0_LC2D2S_POSITION                           0x4
#define _CLC2SEL0_LC2D2S_SIZE                               0x3
#define _CLC2SEL0_LC2D2S_LENGTH                             0x3
#define _CLC2SEL0_LC2D2S_MASK                               0x70

// Register: CLC2SEL1
#define CLC2SEL1 CLC2SEL1
extern volatile unsigned char           CLC2SEL1            __at(0xF1B);
#ifndef _LIB_BUILD
asm("CLC2SEL1 equ 0F1Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LC2D3S0                :1;
        unsigned LC2D3S1                :1;
        unsigned LC2D3S2                :1;
        unsigned                        :1;
        unsigned LC2D4S0                :1;
        unsigned LC2D4S1                :1;
        unsigned LC2D4S2                :1;
    };
    struct {
        unsigned D3S0                   :1;
        unsigned D3S1                   :1;
        unsigned D3S2                   :1;
        unsigned                        :1;
        unsigned D4S0                   :1;
        unsigned D4S1                   :1;
        unsigned D4S2                   :1;
    };
    struct {
        unsigned LC2D3S                 :3;
        unsigned                        :1;
        unsigned LC2D4S                 :3;
    };
} CLC2SEL1bits_t;
